tap 'homebrew/cask'
tap 'homebrew/bundle'
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap 'neovim/neovim'

cask_args appdir: "~/Applications", require_sha: true

brew 'coreutils'
brew 'fd'                  # find
brew 'lazygit'
brew 'ffmpeg'
brew 'git'
brew 'neovim'
brew 'openssl'
brew 'pyenv'
brew 'python'
brew 'readline'            # read
brew 'rbenv'
brew 'reattach-to-user-namespace' # tmux pbcopy
brew 'ripgrep'
brew 'ruby-build'
brew 'scmpuff'             # git [number] shortcuts for files
brew 'tig'
brew 'tmux'
brew 'tmux-mem-cpu-load'
brew 'vim'
brew 'wget'
brew 'youtube-dl'
brew 'zplug'
brew 'zsh'
brew 'zsh-autosuggestions'

cask 'iterm2', args: { appdir: "~/Applications" }
cask 'filebot', args: { appdir: "~/Applications" }
