tap 'homebrew/cask'
tap 'homebrew/bundle'
tap "homebrew/core"
tap "homebrew/services"

tap "jesseduffield/lazygit"
tap 'neovim/neovim'

cask_args appdir: "~/Applications", require_sha: true

# Utilities
brew 'asdf'
brew 'coreutils'           # gls
brew 'fd'                  # find
brew 'ffmpeg'
brew 'fzf'
brew 'gcc'
brew 'openssl'
brew 'readline'            # read
brew 'ripgrep'
brew 'tig'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'zplug'
brew 'zsh'
brew 'zsh-autosuggestions'

# Formatter
brew 'lua-language-server'
brew 'shfmt'
brew 'stylua'

# Languages
brew 'pyenv'
brew 'python'
brew 'rbenv'
brew 'ruby-build'

# Git
brew 'git'
brew 'lazygit'
brew 'scmpuff'             # git [number] shortcuts for files

# Window Manager
brew 'koekeishiya/formulae/skhd'
brew 'yabai'


# Apps
cask 'kitty'
brew 'neovim'
brew 'reattach-to-user-namespace' # tmux pbcopy
brew 'tmux'
brew 'tmux-mem-cpu-load'
brew 'vim'
