# Formulae
brew "git"
brew "stow"
brew "zsh"
brew "neovim"
brew "tmux"
brew "fzf"
brew "bat"
brew "htop"
brew "gh"
brew "jq"
brew "tree"
brew "wget"
brew "mas"
brew "zoxide"
brew "lazygit"
brew "ripgrep"
brew "fd"
brew "ffmpeg"
brew "sevenzip"
brew "poppler"
brew "resvg"
brew "imagemagick"
brew "yazi"
brew "node"
brew "gemini-cli"

# Casks
cask "kitty"
cask "font-symbols-only-nerd-font"
